[
  {
    "title": "Artificial Intelligence | An introduction",
    "category": "AI",
    "description": "Before leading to the meaning of artificial intelligence or AI, let’s understand what is the meaning of the Intelligence:\r\n\r\n<quote><em>“The ability to learn or understand or to deal with new or trying situations.”<\/em><\/quote>\r\n\r\nThe most common answer that one expects is <strong>“to make computers intelligent so that they can act intelligently!”<\/strong>, but the question is how much intelligent? How can one judge the intelligence?\r\n\r\n…as intelligent as humans. \r\n\r\nIf computers can, somehow, solve real-world problems, by improving on their own from the past experiences, they would be called “intelligent”. Thus, the AI systems are more generic (rather than specific), have the ability to “think” and are more flexible.\r\n\r\n<strong>Intelligence is composed of:<\/strong>\r\n<li>\u0017• Reasoning<\/li>\r\n<li>• Learning<\/li>\r\n<li>• Problem Solving<\/li>\r\n<li>• Perception<\/li>\r\n<li>• Linguistic Intelligence<\/li>\r\n\r\n<strong>Need for AI:<\/strong>\r\n<li>1. To create expert systems which exhibit intelligent behavior with the capability to learn, demonstrate, explain, and advice its users.<\/li>\r\n<li>2. Helping machines find solutions to complex problems like humans do and applying them as algorithms in a computer-friendly manner.<\/li>\r\n\r\nAre there limits to how intelligent machines - or human-machine hybrids - can be? A superintelligence or superhuman intelligence is a hypothetical agent that would possess intelligence far surpassing that of the brightest and most gifted human mind."
  },
  {
    "title": "Title",
    "category": "Speech",
    "description": "Description"
  },
  {
    "title": "Title",
    "category": "Speech",
    "description": "Description"
  },
  {
    "title": "Title",
    "category": "Speech",
    "description": "Description"
  }
]
